// ======================================== [ Task #3 ] =====================================================//


function showBall(){
    let ball = +prompt('Введите свой Балл: ', '100')
    if(ball >= 80){
        alert('Поздравляю ! Вы получили Высокий Балл !\n\Ваш Балл: '+ball+'!\n\Ваша Оценка за Балл: A')
    } else if(ball >= 79){
        alert('Поздравляем !! Вы получили Средний Балл !\n\Ваш Балл: '+ball+'!\n\Ваша Оценка за Балл: B')
    } else if(ball >= 50) {
        alert('Поздравляем !! Вы получили Проходной Балл !\n\Ваш Балл: '+ball+'!\n\Ваша Оценка за Балл: C')
    } else if(ball >= 49){
        alert('Поздравляем !! Вы получили Низкий Балл !\n\Ваш Балл: '+ball+'!\n\Ваша Оценка за Балл: D')
    } else if(ball >= 30){
        alert(' Вы получили самый низкий балл ! :c\n\Ваш Балл: '+ball+'!\n\Ваша Оценка за Балл: F\n\Экзамен не Сдан !')
    } else if(ball < 29){
        confirm('Вы Провалили Экзамен !! Желаете подать на пересдачу ?')
    }

}
// showBall()

// ======================================== [ Task #3 END ] =====================================================//

// ======================================== [ Task #!6 ] =====================================================//

function GenPass(){
    let randPass = Math.round(Math.random(1010)*1999901110)
    console.log('Сгенерированный Рандомный Пароль: '+randPass)
    // P.S С Буквами хз как сделать. Слишком маленький уровень познания Языка.
}
// GenPass()

// ======================================== [ Task #!6  END] =====================================================//

// ======================================== [ Task #9  ] =====================================================//

function treiCifre(){

    let first = +prompt('Введите число номер 1: ', '5')
    let two = +prompt('Введите число номер 2: ', '7')
    let three = +prompt('Введите число номер 3: ', '6')
    if(first > two && first > three){
        alert('Число номер 1 ('+first+') Больше,чем Число Номер 2 ('+two+') и чем Число Номер 3('+three+') !')
    } else if(two > first && two > three){
        alert('Число номер 2 ('+two+') Больше,чем Число Номер 1 ('+first+') и чем Число Номер 3('+three+') !')     
    } else if(three > first && three > two){
        alert('Число номер 3 ('+three+') Больше,чем Число Номер 1 ('+first+') и чем Число Номер 2('+two+') !')
    }
}
// treiCifre()

// ======================================== [ Task #9 END ] =====================================================//

// ======================================== [ Task #12  ] =====================================================//

function monthSeason(){
    let season = +prompt('Введите Число,и получите Ответ !', '1')
    let seasonChange =''
    if(season == 1){
       seasonChange = 'Декабрь'
    } else if(season == 2){
        seasonChange = 'Январь'
    } else if(season == 3){
        seasonChange = 'Февраль'
    } else if(season == 4){
        seasonChange = 'Март'
    } else if(season == 5){
        seasonChange = 'Апрель'
    } else if(season == 6){
        seasonChange = 'Май'
    } else if(season == 7){
        seasonChange = 'Июнь'
    }  else if(season == 8){
        seasonChange = 'Июль'
    } else if(season == 9){
        seasonChange = 'Август'
    } else if(season == 10){
        seasonChange = 'Сентябрь'
    } else if(season == 11){
        seasonChange = 'Октябрь'
    } else if(season == 12){
        seasonChange = 'Ноябрь'
    }


    if(season <= 3){
        alert('В этом Месяце -- Зима !\n\INFO:\n\ Месяц: '+seasonChange)
    } else if(season >= 4 && season <= 6){
        alert('В этом Месяце -- Весна !\n\INFO:\n\ Месяц: '+seasonChange)
    } else if(season >= 7 && season <= 9){
        alert('В этом Месяце -- Лето !\n\INFO:\n\ Месяц: '+seasonChange)
    } else if(season >= 10 && season <= 12){
        alert('В этом Месяце -- Осень !\n\INFO:\n\ Месяц: '+seasonChange)
    } else if(season != Number || season >= 13 || season <= -1){
        alert('Error,Check Console !')
        console.log('[ERROR]: Было указано НЕ-число(или такого Месяца не существует) в поле для ввода числа месяца ! (Значение: '+season+')')
    }
}
// monthSeason()

// ======================================== [ Task #12 END ] =====================================================//

// ======================================== [ Task #13  ] =====================================================//
/*
function dlinaFunc(){
    let a = +prompt('Введите число номер 1: ', '5')
    let b = +prompt('Введите число номер 2: ', '6')
    if(a > b){
        alert('Цифра '+a+' дальше '+b+'!')
    } else if(a < b){
        alert('Цифра '+a+' ближе к Цифре '+b+'!')  
    }

}
dlinaFunc()
*/
// ======================================== [ Task #13  END? ] =====================================================//


